###################################################################

# Created by write_sdc on Tue Dec  2 19:25:03 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports clk]  -name CLK  -period 3  -waveform {0 1.5}
set_clock_latency 0.5  [get_clocks CLK]
set_input_delay -clock CLK  1  [get_ports clk]
set_input_delay -clock CLK  1  [get_ports reset]
set_input_delay -clock CLK  1  [get_ports up_si]
set_input_delay -clock CLK  1  [get_ports down_si]
set_input_delay -clock CLK  1  [get_ports left_si]
set_input_delay -clock CLK  1  [get_ports right_si]
set_input_delay -clock CLK  1  [get_ports NIC_si]
set_input_delay -clock CLK  1  [get_ports {up_di[63]}]
set_input_delay -clock CLK  1  [get_ports {up_di[62]}]
set_input_delay -clock CLK  1  [get_ports {up_di[61]}]
set_input_delay -clock CLK  1  [get_ports {up_di[60]}]
set_input_delay -clock CLK  1  [get_ports {up_di[59]}]
set_input_delay -clock CLK  1  [get_ports {up_di[58]}]
set_input_delay -clock CLK  1  [get_ports {up_di[57]}]
set_input_delay -clock CLK  1  [get_ports {up_di[56]}]
set_input_delay -clock CLK  1  [get_ports {up_di[55]}]
set_input_delay -clock CLK  1  [get_ports {up_di[54]}]
set_input_delay -clock CLK  1  [get_ports {up_di[53]}]
set_input_delay -clock CLK  1  [get_ports {up_di[52]}]
set_input_delay -clock CLK  1  [get_ports {up_di[51]}]
set_input_delay -clock CLK  1  [get_ports {up_di[50]}]
set_input_delay -clock CLK  1  [get_ports {up_di[49]}]
set_input_delay -clock CLK  1  [get_ports {up_di[48]}]
set_input_delay -clock CLK  1  [get_ports {up_di[47]}]
set_input_delay -clock CLK  1  [get_ports {up_di[46]}]
set_input_delay -clock CLK  1  [get_ports {up_di[45]}]
set_input_delay -clock CLK  1  [get_ports {up_di[44]}]
set_input_delay -clock CLK  1  [get_ports {up_di[43]}]
set_input_delay -clock CLK  1  [get_ports {up_di[42]}]
set_input_delay -clock CLK  1  [get_ports {up_di[41]}]
set_input_delay -clock CLK  1  [get_ports {up_di[40]}]
set_input_delay -clock CLK  1  [get_ports {up_di[39]}]
set_input_delay -clock CLK  1  [get_ports {up_di[38]}]
set_input_delay -clock CLK  1  [get_ports {up_di[37]}]
set_input_delay -clock CLK  1  [get_ports {up_di[36]}]
set_input_delay -clock CLK  1  [get_ports {up_di[35]}]
set_input_delay -clock CLK  1  [get_ports {up_di[34]}]
set_input_delay -clock CLK  1  [get_ports {up_di[33]}]
set_input_delay -clock CLK  1  [get_ports {up_di[32]}]
set_input_delay -clock CLK  1  [get_ports {up_di[31]}]
set_input_delay -clock CLK  1  [get_ports {up_di[30]}]
set_input_delay -clock CLK  1  [get_ports {up_di[29]}]
set_input_delay -clock CLK  1  [get_ports {up_di[28]}]
set_input_delay -clock CLK  1  [get_ports {up_di[27]}]
set_input_delay -clock CLK  1  [get_ports {up_di[26]}]
set_input_delay -clock CLK  1  [get_ports {up_di[25]}]
set_input_delay -clock CLK  1  [get_ports {up_di[24]}]
set_input_delay -clock CLK  1  [get_ports {up_di[23]}]
set_input_delay -clock CLK  1  [get_ports {up_di[22]}]
set_input_delay -clock CLK  1  [get_ports {up_di[21]}]
set_input_delay -clock CLK  1  [get_ports {up_di[20]}]
set_input_delay -clock CLK  1  [get_ports {up_di[19]}]
set_input_delay -clock CLK  1  [get_ports {up_di[18]}]
set_input_delay -clock CLK  1  [get_ports {up_di[17]}]
set_input_delay -clock CLK  1  [get_ports {up_di[16]}]
set_input_delay -clock CLK  1  [get_ports {up_di[15]}]
set_input_delay -clock CLK  1  [get_ports {up_di[14]}]
set_input_delay -clock CLK  1  [get_ports {up_di[13]}]
set_input_delay -clock CLK  1  [get_ports {up_di[12]}]
set_input_delay -clock CLK  1  [get_ports {up_di[11]}]
set_input_delay -clock CLK  1  [get_ports {up_di[10]}]
set_input_delay -clock CLK  1  [get_ports {up_di[9]}]
set_input_delay -clock CLK  1  [get_ports {up_di[8]}]
set_input_delay -clock CLK  1  [get_ports {up_di[7]}]
set_input_delay -clock CLK  1  [get_ports {up_di[6]}]
set_input_delay -clock CLK  1  [get_ports {up_di[5]}]
set_input_delay -clock CLK  1  [get_ports {up_di[4]}]
set_input_delay -clock CLK  1  [get_ports {up_di[3]}]
set_input_delay -clock CLK  1  [get_ports {up_di[2]}]
set_input_delay -clock CLK  1  [get_ports {up_di[1]}]
set_input_delay -clock CLK  1  [get_ports {up_di[0]}]
set_input_delay -clock CLK  1  [get_ports {down_di[63]}]
set_input_delay -clock CLK  1  [get_ports {down_di[62]}]
set_input_delay -clock CLK  1  [get_ports {down_di[61]}]
set_input_delay -clock CLK  1  [get_ports {down_di[60]}]
set_input_delay -clock CLK  1  [get_ports {down_di[59]}]
set_input_delay -clock CLK  1  [get_ports {down_di[58]}]
set_input_delay -clock CLK  1  [get_ports {down_di[57]}]
set_input_delay -clock CLK  1  [get_ports {down_di[56]}]
set_input_delay -clock CLK  1  [get_ports {down_di[55]}]
set_input_delay -clock CLK  1  [get_ports {down_di[54]}]
set_input_delay -clock CLK  1  [get_ports {down_di[53]}]
set_input_delay -clock CLK  1  [get_ports {down_di[52]}]
set_input_delay -clock CLK  1  [get_ports {down_di[51]}]
set_input_delay -clock CLK  1  [get_ports {down_di[50]}]
set_input_delay -clock CLK  1  [get_ports {down_di[49]}]
set_input_delay -clock CLK  1  [get_ports {down_di[48]}]
set_input_delay -clock CLK  1  [get_ports {down_di[47]}]
set_input_delay -clock CLK  1  [get_ports {down_di[46]}]
set_input_delay -clock CLK  1  [get_ports {down_di[45]}]
set_input_delay -clock CLK  1  [get_ports {down_di[44]}]
set_input_delay -clock CLK  1  [get_ports {down_di[43]}]
set_input_delay -clock CLK  1  [get_ports {down_di[42]}]
set_input_delay -clock CLK  1  [get_ports {down_di[41]}]
set_input_delay -clock CLK  1  [get_ports {down_di[40]}]
set_input_delay -clock CLK  1  [get_ports {down_di[39]}]
set_input_delay -clock CLK  1  [get_ports {down_di[38]}]
set_input_delay -clock CLK  1  [get_ports {down_di[37]}]
set_input_delay -clock CLK  1  [get_ports {down_di[36]}]
set_input_delay -clock CLK  1  [get_ports {down_di[35]}]
set_input_delay -clock CLK  1  [get_ports {down_di[34]}]
set_input_delay -clock CLK  1  [get_ports {down_di[33]}]
set_input_delay -clock CLK  1  [get_ports {down_di[32]}]
set_input_delay -clock CLK  1  [get_ports {down_di[31]}]
set_input_delay -clock CLK  1  [get_ports {down_di[30]}]
set_input_delay -clock CLK  1  [get_ports {down_di[29]}]
set_input_delay -clock CLK  1  [get_ports {down_di[28]}]
set_input_delay -clock CLK  1  [get_ports {down_di[27]}]
set_input_delay -clock CLK  1  [get_ports {down_di[26]}]
set_input_delay -clock CLK  1  [get_ports {down_di[25]}]
set_input_delay -clock CLK  1  [get_ports {down_di[24]}]
set_input_delay -clock CLK  1  [get_ports {down_di[23]}]
set_input_delay -clock CLK  1  [get_ports {down_di[22]}]
set_input_delay -clock CLK  1  [get_ports {down_di[21]}]
set_input_delay -clock CLK  1  [get_ports {down_di[20]}]
set_input_delay -clock CLK  1  [get_ports {down_di[19]}]
set_input_delay -clock CLK  1  [get_ports {down_di[18]}]
set_input_delay -clock CLK  1  [get_ports {down_di[17]}]
set_input_delay -clock CLK  1  [get_ports {down_di[16]}]
set_input_delay -clock CLK  1  [get_ports {down_di[15]}]
set_input_delay -clock CLK  1  [get_ports {down_di[14]}]
set_input_delay -clock CLK  1  [get_ports {down_di[13]}]
set_input_delay -clock CLK  1  [get_ports {down_di[12]}]
set_input_delay -clock CLK  1  [get_ports {down_di[11]}]
set_input_delay -clock CLK  1  [get_ports {down_di[10]}]
set_input_delay -clock CLK  1  [get_ports {down_di[9]}]
set_input_delay -clock CLK  1  [get_ports {down_di[8]}]
set_input_delay -clock CLK  1  [get_ports {down_di[7]}]
set_input_delay -clock CLK  1  [get_ports {down_di[6]}]
set_input_delay -clock CLK  1  [get_ports {down_di[5]}]
set_input_delay -clock CLK  1  [get_ports {down_di[4]}]
set_input_delay -clock CLK  1  [get_ports {down_di[3]}]
set_input_delay -clock CLK  1  [get_ports {down_di[2]}]
set_input_delay -clock CLK  1  [get_ports {down_di[1]}]
set_input_delay -clock CLK  1  [get_ports {down_di[0]}]
set_input_delay -clock CLK  1  [get_ports {left_di[63]}]
set_input_delay -clock CLK  1  [get_ports {left_di[62]}]
set_input_delay -clock CLK  1  [get_ports {left_di[61]}]
set_input_delay -clock CLK  1  [get_ports {left_di[60]}]
set_input_delay -clock CLK  1  [get_ports {left_di[59]}]
set_input_delay -clock CLK  1  [get_ports {left_di[58]}]
set_input_delay -clock CLK  1  [get_ports {left_di[57]}]
set_input_delay -clock CLK  1  [get_ports {left_di[56]}]
set_input_delay -clock CLK  1  [get_ports {left_di[55]}]
set_input_delay -clock CLK  1  [get_ports {left_di[54]}]
set_input_delay -clock CLK  1  [get_ports {left_di[53]}]
set_input_delay -clock CLK  1  [get_ports {left_di[52]}]
set_input_delay -clock CLK  1  [get_ports {left_di[51]}]
set_input_delay -clock CLK  1  [get_ports {left_di[50]}]
set_input_delay -clock CLK  1  [get_ports {left_di[49]}]
set_input_delay -clock CLK  1  [get_ports {left_di[48]}]
set_input_delay -clock CLK  1  [get_ports {left_di[47]}]
set_input_delay -clock CLK  1  [get_ports {left_di[46]}]
set_input_delay -clock CLK  1  [get_ports {left_di[45]}]
set_input_delay -clock CLK  1  [get_ports {left_di[44]}]
set_input_delay -clock CLK  1  [get_ports {left_di[43]}]
set_input_delay -clock CLK  1  [get_ports {left_di[42]}]
set_input_delay -clock CLK  1  [get_ports {left_di[41]}]
set_input_delay -clock CLK  1  [get_ports {left_di[40]}]
set_input_delay -clock CLK  1  [get_ports {left_di[39]}]
set_input_delay -clock CLK  1  [get_ports {left_di[38]}]
set_input_delay -clock CLK  1  [get_ports {left_di[37]}]
set_input_delay -clock CLK  1  [get_ports {left_di[36]}]
set_input_delay -clock CLK  1  [get_ports {left_di[35]}]
set_input_delay -clock CLK  1  [get_ports {left_di[34]}]
set_input_delay -clock CLK  1  [get_ports {left_di[33]}]
set_input_delay -clock CLK  1  [get_ports {left_di[32]}]
set_input_delay -clock CLK  1  [get_ports {left_di[31]}]
set_input_delay -clock CLK  1  [get_ports {left_di[30]}]
set_input_delay -clock CLK  1  [get_ports {left_di[29]}]
set_input_delay -clock CLK  1  [get_ports {left_di[28]}]
set_input_delay -clock CLK  1  [get_ports {left_di[27]}]
set_input_delay -clock CLK  1  [get_ports {left_di[26]}]
set_input_delay -clock CLK  1  [get_ports {left_di[25]}]
set_input_delay -clock CLK  1  [get_ports {left_di[24]}]
set_input_delay -clock CLK  1  [get_ports {left_di[23]}]
set_input_delay -clock CLK  1  [get_ports {left_di[22]}]
set_input_delay -clock CLK  1  [get_ports {left_di[21]}]
set_input_delay -clock CLK  1  [get_ports {left_di[20]}]
set_input_delay -clock CLK  1  [get_ports {left_di[19]}]
set_input_delay -clock CLK  1  [get_ports {left_di[18]}]
set_input_delay -clock CLK  1  [get_ports {left_di[17]}]
set_input_delay -clock CLK  1  [get_ports {left_di[16]}]
set_input_delay -clock CLK  1  [get_ports {left_di[15]}]
set_input_delay -clock CLK  1  [get_ports {left_di[14]}]
set_input_delay -clock CLK  1  [get_ports {left_di[13]}]
set_input_delay -clock CLK  1  [get_ports {left_di[12]}]
set_input_delay -clock CLK  1  [get_ports {left_di[11]}]
set_input_delay -clock CLK  1  [get_ports {left_di[10]}]
set_input_delay -clock CLK  1  [get_ports {left_di[9]}]
set_input_delay -clock CLK  1  [get_ports {left_di[8]}]
set_input_delay -clock CLK  1  [get_ports {left_di[7]}]
set_input_delay -clock CLK  1  [get_ports {left_di[6]}]
set_input_delay -clock CLK  1  [get_ports {left_di[5]}]
set_input_delay -clock CLK  1  [get_ports {left_di[4]}]
set_input_delay -clock CLK  1  [get_ports {left_di[3]}]
set_input_delay -clock CLK  1  [get_ports {left_di[2]}]
set_input_delay -clock CLK  1  [get_ports {left_di[1]}]
set_input_delay -clock CLK  1  [get_ports {left_di[0]}]
set_input_delay -clock CLK  1  [get_ports {right_di[63]}]
set_input_delay -clock CLK  1  [get_ports {right_di[62]}]
set_input_delay -clock CLK  1  [get_ports {right_di[61]}]
set_input_delay -clock CLK  1  [get_ports {right_di[60]}]
set_input_delay -clock CLK  1  [get_ports {right_di[59]}]
set_input_delay -clock CLK  1  [get_ports {right_di[58]}]
set_input_delay -clock CLK  1  [get_ports {right_di[57]}]
set_input_delay -clock CLK  1  [get_ports {right_di[56]}]
set_input_delay -clock CLK  1  [get_ports {right_di[55]}]
set_input_delay -clock CLK  1  [get_ports {right_di[54]}]
set_input_delay -clock CLK  1  [get_ports {right_di[53]}]
set_input_delay -clock CLK  1  [get_ports {right_di[52]}]
set_input_delay -clock CLK  1  [get_ports {right_di[51]}]
set_input_delay -clock CLK  1  [get_ports {right_di[50]}]
set_input_delay -clock CLK  1  [get_ports {right_di[49]}]
set_input_delay -clock CLK  1  [get_ports {right_di[48]}]
set_input_delay -clock CLK  1  [get_ports {right_di[47]}]
set_input_delay -clock CLK  1  [get_ports {right_di[46]}]
set_input_delay -clock CLK  1  [get_ports {right_di[45]}]
set_input_delay -clock CLK  1  [get_ports {right_di[44]}]
set_input_delay -clock CLK  1  [get_ports {right_di[43]}]
set_input_delay -clock CLK  1  [get_ports {right_di[42]}]
set_input_delay -clock CLK  1  [get_ports {right_di[41]}]
set_input_delay -clock CLK  1  [get_ports {right_di[40]}]
set_input_delay -clock CLK  1  [get_ports {right_di[39]}]
set_input_delay -clock CLK  1  [get_ports {right_di[38]}]
set_input_delay -clock CLK  1  [get_ports {right_di[37]}]
set_input_delay -clock CLK  1  [get_ports {right_di[36]}]
set_input_delay -clock CLK  1  [get_ports {right_di[35]}]
set_input_delay -clock CLK  1  [get_ports {right_di[34]}]
set_input_delay -clock CLK  1  [get_ports {right_di[33]}]
set_input_delay -clock CLK  1  [get_ports {right_di[32]}]
set_input_delay -clock CLK  1  [get_ports {right_di[31]}]
set_input_delay -clock CLK  1  [get_ports {right_di[30]}]
set_input_delay -clock CLK  1  [get_ports {right_di[29]}]
set_input_delay -clock CLK  1  [get_ports {right_di[28]}]
set_input_delay -clock CLK  1  [get_ports {right_di[27]}]
set_input_delay -clock CLK  1  [get_ports {right_di[26]}]
set_input_delay -clock CLK  1  [get_ports {right_di[25]}]
set_input_delay -clock CLK  1  [get_ports {right_di[24]}]
set_input_delay -clock CLK  1  [get_ports {right_di[23]}]
set_input_delay -clock CLK  1  [get_ports {right_di[22]}]
set_input_delay -clock CLK  1  [get_ports {right_di[21]}]
set_input_delay -clock CLK  1  [get_ports {right_di[20]}]
set_input_delay -clock CLK  1  [get_ports {right_di[19]}]
set_input_delay -clock CLK  1  [get_ports {right_di[18]}]
set_input_delay -clock CLK  1  [get_ports {right_di[17]}]
set_input_delay -clock CLK  1  [get_ports {right_di[16]}]
set_input_delay -clock CLK  1  [get_ports {right_di[15]}]
set_input_delay -clock CLK  1  [get_ports {right_di[14]}]
set_input_delay -clock CLK  1  [get_ports {right_di[13]}]
set_input_delay -clock CLK  1  [get_ports {right_di[12]}]
set_input_delay -clock CLK  1  [get_ports {right_di[11]}]
set_input_delay -clock CLK  1  [get_ports {right_di[10]}]
set_input_delay -clock CLK  1  [get_ports {right_di[9]}]
set_input_delay -clock CLK  1  [get_ports {right_di[8]}]
set_input_delay -clock CLK  1  [get_ports {right_di[7]}]
set_input_delay -clock CLK  1  [get_ports {right_di[6]}]
set_input_delay -clock CLK  1  [get_ports {right_di[5]}]
set_input_delay -clock CLK  1  [get_ports {right_di[4]}]
set_input_delay -clock CLK  1  [get_ports {right_di[3]}]
set_input_delay -clock CLK  1  [get_ports {right_di[2]}]
set_input_delay -clock CLK  1  [get_ports {right_di[1]}]
set_input_delay -clock CLK  1  [get_ports {right_di[0]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[63]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[62]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[61]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[60]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[59]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[58]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[57]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[56]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[55]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[54]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[53]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[52]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[51]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[50]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[49]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[48]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[47]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[46]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[45]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[44]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[43]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[42]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[41]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[40]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[39]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[38]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[37]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[36]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[35]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[34]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[33]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[32]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[31]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[30]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[29]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[28]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[27]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[26]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[25]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[24]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[23]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[22]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[21]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[20]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[19]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[18]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[17]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[16]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[15]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[14]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[13]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[12]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[11]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[10]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[9]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[8]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[7]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[6]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[5]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[4]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[3]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[2]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[1]}]
set_input_delay -clock CLK  1  [get_ports {NIC_di[0]}]
set_input_delay -clock CLK  1  [get_ports up_ro]
set_input_delay -clock CLK  1  [get_ports down_ro]
set_input_delay -clock CLK  1  [get_ports left_ro]
set_input_delay -clock CLK  1  [get_ports right_ro]
set_input_delay -clock CLK  1  [get_ports NIC_ro]
set_output_delay -clock CLK  1  [get_ports up_ri]
set_output_delay -clock CLK  1  [get_ports down_ri]
set_output_delay -clock CLK  1  [get_ports left_ri]
set_output_delay -clock CLK  1  [get_ports right_ri]
set_output_delay -clock CLK  1  [get_ports NIC_ri]
set_output_delay -clock CLK  1  [get_ports up_so]
set_output_delay -clock CLK  1  [get_ports down_so]
set_output_delay -clock CLK  1  [get_ports left_so]
set_output_delay -clock CLK  1  [get_ports right_so]
set_output_delay -clock CLK  1  [get_ports NIC_so]
set_output_delay -clock CLK  1  [get_ports {up_do[63]}]
set_output_delay -clock CLK  1  [get_ports {up_do[62]}]
set_output_delay -clock CLK  1  [get_ports {up_do[61]}]
set_output_delay -clock CLK  1  [get_ports {up_do[60]}]
set_output_delay -clock CLK  1  [get_ports {up_do[59]}]
set_output_delay -clock CLK  1  [get_ports {up_do[58]}]
set_output_delay -clock CLK  1  [get_ports {up_do[57]}]
set_output_delay -clock CLK  1  [get_ports {up_do[56]}]
set_output_delay -clock CLK  1  [get_ports {up_do[55]}]
set_output_delay -clock CLK  1  [get_ports {up_do[54]}]
set_output_delay -clock CLK  1  [get_ports {up_do[53]}]
set_output_delay -clock CLK  1  [get_ports {up_do[52]}]
set_output_delay -clock CLK  1  [get_ports {up_do[51]}]
set_output_delay -clock CLK  1  [get_ports {up_do[50]}]
set_output_delay -clock CLK  1  [get_ports {up_do[49]}]
set_output_delay -clock CLK  1  [get_ports {up_do[48]}]
set_output_delay -clock CLK  1  [get_ports {up_do[47]}]
set_output_delay -clock CLK  1  [get_ports {up_do[46]}]
set_output_delay -clock CLK  1  [get_ports {up_do[45]}]
set_output_delay -clock CLK  1  [get_ports {up_do[44]}]
set_output_delay -clock CLK  1  [get_ports {up_do[43]}]
set_output_delay -clock CLK  1  [get_ports {up_do[42]}]
set_output_delay -clock CLK  1  [get_ports {up_do[41]}]
set_output_delay -clock CLK  1  [get_ports {up_do[40]}]
set_output_delay -clock CLK  1  [get_ports {up_do[39]}]
set_output_delay -clock CLK  1  [get_ports {up_do[38]}]
set_output_delay -clock CLK  1  [get_ports {up_do[37]}]
set_output_delay -clock CLK  1  [get_ports {up_do[36]}]
set_output_delay -clock CLK  1  [get_ports {up_do[35]}]
set_output_delay -clock CLK  1  [get_ports {up_do[34]}]
set_output_delay -clock CLK  1  [get_ports {up_do[33]}]
set_output_delay -clock CLK  1  [get_ports {up_do[32]}]
set_output_delay -clock CLK  1  [get_ports {up_do[31]}]
set_output_delay -clock CLK  1  [get_ports {up_do[30]}]
set_output_delay -clock CLK  1  [get_ports {up_do[29]}]
set_output_delay -clock CLK  1  [get_ports {up_do[28]}]
set_output_delay -clock CLK  1  [get_ports {up_do[27]}]
set_output_delay -clock CLK  1  [get_ports {up_do[26]}]
set_output_delay -clock CLK  1  [get_ports {up_do[25]}]
set_output_delay -clock CLK  1  [get_ports {up_do[24]}]
set_output_delay -clock CLK  1  [get_ports {up_do[23]}]
set_output_delay -clock CLK  1  [get_ports {up_do[22]}]
set_output_delay -clock CLK  1  [get_ports {up_do[21]}]
set_output_delay -clock CLK  1  [get_ports {up_do[20]}]
set_output_delay -clock CLK  1  [get_ports {up_do[19]}]
set_output_delay -clock CLK  1  [get_ports {up_do[18]}]
set_output_delay -clock CLK  1  [get_ports {up_do[17]}]
set_output_delay -clock CLK  1  [get_ports {up_do[16]}]
set_output_delay -clock CLK  1  [get_ports {up_do[15]}]
set_output_delay -clock CLK  1  [get_ports {up_do[14]}]
set_output_delay -clock CLK  1  [get_ports {up_do[13]}]
set_output_delay -clock CLK  1  [get_ports {up_do[12]}]
set_output_delay -clock CLK  1  [get_ports {up_do[11]}]
set_output_delay -clock CLK  1  [get_ports {up_do[10]}]
set_output_delay -clock CLK  1  [get_ports {up_do[9]}]
set_output_delay -clock CLK  1  [get_ports {up_do[8]}]
set_output_delay -clock CLK  1  [get_ports {up_do[7]}]
set_output_delay -clock CLK  1  [get_ports {up_do[6]}]
set_output_delay -clock CLK  1  [get_ports {up_do[5]}]
set_output_delay -clock CLK  1  [get_ports {up_do[4]}]
set_output_delay -clock CLK  1  [get_ports {up_do[3]}]
set_output_delay -clock CLK  1  [get_ports {up_do[2]}]
set_output_delay -clock CLK  1  [get_ports {up_do[1]}]
set_output_delay -clock CLK  1  [get_ports {up_do[0]}]
set_output_delay -clock CLK  1  [get_ports {down_do[63]}]
set_output_delay -clock CLK  1  [get_ports {down_do[62]}]
set_output_delay -clock CLK  1  [get_ports {down_do[61]}]
set_output_delay -clock CLK  1  [get_ports {down_do[60]}]
set_output_delay -clock CLK  1  [get_ports {down_do[59]}]
set_output_delay -clock CLK  1  [get_ports {down_do[58]}]
set_output_delay -clock CLK  1  [get_ports {down_do[57]}]
set_output_delay -clock CLK  1  [get_ports {down_do[56]}]
set_output_delay -clock CLK  1  [get_ports {down_do[55]}]
set_output_delay -clock CLK  1  [get_ports {down_do[54]}]
set_output_delay -clock CLK  1  [get_ports {down_do[53]}]
set_output_delay -clock CLK  1  [get_ports {down_do[52]}]
set_output_delay -clock CLK  1  [get_ports {down_do[51]}]
set_output_delay -clock CLK  1  [get_ports {down_do[50]}]
set_output_delay -clock CLK  1  [get_ports {down_do[49]}]
set_output_delay -clock CLK  1  [get_ports {down_do[48]}]
set_output_delay -clock CLK  1  [get_ports {down_do[47]}]
set_output_delay -clock CLK  1  [get_ports {down_do[46]}]
set_output_delay -clock CLK  1  [get_ports {down_do[45]}]
set_output_delay -clock CLK  1  [get_ports {down_do[44]}]
set_output_delay -clock CLK  1  [get_ports {down_do[43]}]
set_output_delay -clock CLK  1  [get_ports {down_do[42]}]
set_output_delay -clock CLK  1  [get_ports {down_do[41]}]
set_output_delay -clock CLK  1  [get_ports {down_do[40]}]
set_output_delay -clock CLK  1  [get_ports {down_do[39]}]
set_output_delay -clock CLK  1  [get_ports {down_do[38]}]
set_output_delay -clock CLK  1  [get_ports {down_do[37]}]
set_output_delay -clock CLK  1  [get_ports {down_do[36]}]
set_output_delay -clock CLK  1  [get_ports {down_do[35]}]
set_output_delay -clock CLK  1  [get_ports {down_do[34]}]
set_output_delay -clock CLK  1  [get_ports {down_do[33]}]
set_output_delay -clock CLK  1  [get_ports {down_do[32]}]
set_output_delay -clock CLK  1  [get_ports {down_do[31]}]
set_output_delay -clock CLK  1  [get_ports {down_do[30]}]
set_output_delay -clock CLK  1  [get_ports {down_do[29]}]
set_output_delay -clock CLK  1  [get_ports {down_do[28]}]
set_output_delay -clock CLK  1  [get_ports {down_do[27]}]
set_output_delay -clock CLK  1  [get_ports {down_do[26]}]
set_output_delay -clock CLK  1  [get_ports {down_do[25]}]
set_output_delay -clock CLK  1  [get_ports {down_do[24]}]
set_output_delay -clock CLK  1  [get_ports {down_do[23]}]
set_output_delay -clock CLK  1  [get_ports {down_do[22]}]
set_output_delay -clock CLK  1  [get_ports {down_do[21]}]
set_output_delay -clock CLK  1  [get_ports {down_do[20]}]
set_output_delay -clock CLK  1  [get_ports {down_do[19]}]
set_output_delay -clock CLK  1  [get_ports {down_do[18]}]
set_output_delay -clock CLK  1  [get_ports {down_do[17]}]
set_output_delay -clock CLK  1  [get_ports {down_do[16]}]
set_output_delay -clock CLK  1  [get_ports {down_do[15]}]
set_output_delay -clock CLK  1  [get_ports {down_do[14]}]
set_output_delay -clock CLK  1  [get_ports {down_do[13]}]
set_output_delay -clock CLK  1  [get_ports {down_do[12]}]
set_output_delay -clock CLK  1  [get_ports {down_do[11]}]
set_output_delay -clock CLK  1  [get_ports {down_do[10]}]
set_output_delay -clock CLK  1  [get_ports {down_do[9]}]
set_output_delay -clock CLK  1  [get_ports {down_do[8]}]
set_output_delay -clock CLK  1  [get_ports {down_do[7]}]
set_output_delay -clock CLK  1  [get_ports {down_do[6]}]
set_output_delay -clock CLK  1  [get_ports {down_do[5]}]
set_output_delay -clock CLK  1  [get_ports {down_do[4]}]
set_output_delay -clock CLK  1  [get_ports {down_do[3]}]
set_output_delay -clock CLK  1  [get_ports {down_do[2]}]
set_output_delay -clock CLK  1  [get_ports {down_do[1]}]
set_output_delay -clock CLK  1  [get_ports {down_do[0]}]
set_output_delay -clock CLK  1  [get_ports {left_do[63]}]
set_output_delay -clock CLK  1  [get_ports {left_do[62]}]
set_output_delay -clock CLK  1  [get_ports {left_do[61]}]
set_output_delay -clock CLK  1  [get_ports {left_do[60]}]
set_output_delay -clock CLK  1  [get_ports {left_do[59]}]
set_output_delay -clock CLK  1  [get_ports {left_do[58]}]
set_output_delay -clock CLK  1  [get_ports {left_do[57]}]
set_output_delay -clock CLK  1  [get_ports {left_do[56]}]
set_output_delay -clock CLK  1  [get_ports {left_do[55]}]
set_output_delay -clock CLK  1  [get_ports {left_do[54]}]
set_output_delay -clock CLK  1  [get_ports {left_do[53]}]
set_output_delay -clock CLK  1  [get_ports {left_do[52]}]
set_output_delay -clock CLK  1  [get_ports {left_do[51]}]
set_output_delay -clock CLK  1  [get_ports {left_do[50]}]
set_output_delay -clock CLK  1  [get_ports {left_do[49]}]
set_output_delay -clock CLK  1  [get_ports {left_do[48]}]
set_output_delay -clock CLK  1  [get_ports {left_do[47]}]
set_output_delay -clock CLK  1  [get_ports {left_do[46]}]
set_output_delay -clock CLK  1  [get_ports {left_do[45]}]
set_output_delay -clock CLK  1  [get_ports {left_do[44]}]
set_output_delay -clock CLK  1  [get_ports {left_do[43]}]
set_output_delay -clock CLK  1  [get_ports {left_do[42]}]
set_output_delay -clock CLK  1  [get_ports {left_do[41]}]
set_output_delay -clock CLK  1  [get_ports {left_do[40]}]
set_output_delay -clock CLK  1  [get_ports {left_do[39]}]
set_output_delay -clock CLK  1  [get_ports {left_do[38]}]
set_output_delay -clock CLK  1  [get_ports {left_do[37]}]
set_output_delay -clock CLK  1  [get_ports {left_do[36]}]
set_output_delay -clock CLK  1  [get_ports {left_do[35]}]
set_output_delay -clock CLK  1  [get_ports {left_do[34]}]
set_output_delay -clock CLK  1  [get_ports {left_do[33]}]
set_output_delay -clock CLK  1  [get_ports {left_do[32]}]
set_output_delay -clock CLK  1  [get_ports {left_do[31]}]
set_output_delay -clock CLK  1  [get_ports {left_do[30]}]
set_output_delay -clock CLK  1  [get_ports {left_do[29]}]
set_output_delay -clock CLK  1  [get_ports {left_do[28]}]
set_output_delay -clock CLK  1  [get_ports {left_do[27]}]
set_output_delay -clock CLK  1  [get_ports {left_do[26]}]
set_output_delay -clock CLK  1  [get_ports {left_do[25]}]
set_output_delay -clock CLK  1  [get_ports {left_do[24]}]
set_output_delay -clock CLK  1  [get_ports {left_do[23]}]
set_output_delay -clock CLK  1  [get_ports {left_do[22]}]
set_output_delay -clock CLK  1  [get_ports {left_do[21]}]
set_output_delay -clock CLK  1  [get_ports {left_do[20]}]
set_output_delay -clock CLK  1  [get_ports {left_do[19]}]
set_output_delay -clock CLK  1  [get_ports {left_do[18]}]
set_output_delay -clock CLK  1  [get_ports {left_do[17]}]
set_output_delay -clock CLK  1  [get_ports {left_do[16]}]
set_output_delay -clock CLK  1  [get_ports {left_do[15]}]
set_output_delay -clock CLK  1  [get_ports {left_do[14]}]
set_output_delay -clock CLK  1  [get_ports {left_do[13]}]
set_output_delay -clock CLK  1  [get_ports {left_do[12]}]
set_output_delay -clock CLK  1  [get_ports {left_do[11]}]
set_output_delay -clock CLK  1  [get_ports {left_do[10]}]
set_output_delay -clock CLK  1  [get_ports {left_do[9]}]
set_output_delay -clock CLK  1  [get_ports {left_do[8]}]
set_output_delay -clock CLK  1  [get_ports {left_do[7]}]
set_output_delay -clock CLK  1  [get_ports {left_do[6]}]
set_output_delay -clock CLK  1  [get_ports {left_do[5]}]
set_output_delay -clock CLK  1  [get_ports {left_do[4]}]
set_output_delay -clock CLK  1  [get_ports {left_do[3]}]
set_output_delay -clock CLK  1  [get_ports {left_do[2]}]
set_output_delay -clock CLK  1  [get_ports {left_do[1]}]
set_output_delay -clock CLK  1  [get_ports {left_do[0]}]
set_output_delay -clock CLK  1  [get_ports {right_do[63]}]
set_output_delay -clock CLK  1  [get_ports {right_do[62]}]
set_output_delay -clock CLK  1  [get_ports {right_do[61]}]
set_output_delay -clock CLK  1  [get_ports {right_do[60]}]
set_output_delay -clock CLK  1  [get_ports {right_do[59]}]
set_output_delay -clock CLK  1  [get_ports {right_do[58]}]
set_output_delay -clock CLK  1  [get_ports {right_do[57]}]
set_output_delay -clock CLK  1  [get_ports {right_do[56]}]
set_output_delay -clock CLK  1  [get_ports {right_do[55]}]
set_output_delay -clock CLK  1  [get_ports {right_do[54]}]
set_output_delay -clock CLK  1  [get_ports {right_do[53]}]
set_output_delay -clock CLK  1  [get_ports {right_do[52]}]
set_output_delay -clock CLK  1  [get_ports {right_do[51]}]
set_output_delay -clock CLK  1  [get_ports {right_do[50]}]
set_output_delay -clock CLK  1  [get_ports {right_do[49]}]
set_output_delay -clock CLK  1  [get_ports {right_do[48]}]
set_output_delay -clock CLK  1  [get_ports {right_do[47]}]
set_output_delay -clock CLK  1  [get_ports {right_do[46]}]
set_output_delay -clock CLK  1  [get_ports {right_do[45]}]
set_output_delay -clock CLK  1  [get_ports {right_do[44]}]
set_output_delay -clock CLK  1  [get_ports {right_do[43]}]
set_output_delay -clock CLK  1  [get_ports {right_do[42]}]
set_output_delay -clock CLK  1  [get_ports {right_do[41]}]
set_output_delay -clock CLK  1  [get_ports {right_do[40]}]
set_output_delay -clock CLK  1  [get_ports {right_do[39]}]
set_output_delay -clock CLK  1  [get_ports {right_do[38]}]
set_output_delay -clock CLK  1  [get_ports {right_do[37]}]
set_output_delay -clock CLK  1  [get_ports {right_do[36]}]
set_output_delay -clock CLK  1  [get_ports {right_do[35]}]
set_output_delay -clock CLK  1  [get_ports {right_do[34]}]
set_output_delay -clock CLK  1  [get_ports {right_do[33]}]
set_output_delay -clock CLK  1  [get_ports {right_do[32]}]
set_output_delay -clock CLK  1  [get_ports {right_do[31]}]
set_output_delay -clock CLK  1  [get_ports {right_do[30]}]
set_output_delay -clock CLK  1  [get_ports {right_do[29]}]
set_output_delay -clock CLK  1  [get_ports {right_do[28]}]
set_output_delay -clock CLK  1  [get_ports {right_do[27]}]
set_output_delay -clock CLK  1  [get_ports {right_do[26]}]
set_output_delay -clock CLK  1  [get_ports {right_do[25]}]
set_output_delay -clock CLK  1  [get_ports {right_do[24]}]
set_output_delay -clock CLK  1  [get_ports {right_do[23]}]
set_output_delay -clock CLK  1  [get_ports {right_do[22]}]
set_output_delay -clock CLK  1  [get_ports {right_do[21]}]
set_output_delay -clock CLK  1  [get_ports {right_do[20]}]
set_output_delay -clock CLK  1  [get_ports {right_do[19]}]
set_output_delay -clock CLK  1  [get_ports {right_do[18]}]
set_output_delay -clock CLK  1  [get_ports {right_do[17]}]
set_output_delay -clock CLK  1  [get_ports {right_do[16]}]
set_output_delay -clock CLK  1  [get_ports {right_do[15]}]
set_output_delay -clock CLK  1  [get_ports {right_do[14]}]
set_output_delay -clock CLK  1  [get_ports {right_do[13]}]
set_output_delay -clock CLK  1  [get_ports {right_do[12]}]
set_output_delay -clock CLK  1  [get_ports {right_do[11]}]
set_output_delay -clock CLK  1  [get_ports {right_do[10]}]
set_output_delay -clock CLK  1  [get_ports {right_do[9]}]
set_output_delay -clock CLK  1  [get_ports {right_do[8]}]
set_output_delay -clock CLK  1  [get_ports {right_do[7]}]
set_output_delay -clock CLK  1  [get_ports {right_do[6]}]
set_output_delay -clock CLK  1  [get_ports {right_do[5]}]
set_output_delay -clock CLK  1  [get_ports {right_do[4]}]
set_output_delay -clock CLK  1  [get_ports {right_do[3]}]
set_output_delay -clock CLK  1  [get_ports {right_do[2]}]
set_output_delay -clock CLK  1  [get_ports {right_do[1]}]
set_output_delay -clock CLK  1  [get_ports {right_do[0]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[63]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[62]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[61]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[60]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[59]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[58]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[57]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[56]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[55]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[54]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[53]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[52]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[51]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[50]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[49]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[48]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[47]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[46]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[45]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[44]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[43]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[42]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[41]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[40]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[39]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[38]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[37]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[36]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[35]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[34]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[33]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[32]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[31]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[30]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[29]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[28]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[27]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[26]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[25]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[24]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[23]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[22]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[21]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[20]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[19]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[18]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[17]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[16]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[15]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[14]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[13]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[12]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[11]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[10]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[9]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[8]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[7]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[6]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[5]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[4]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[3]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[2]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[1]}]
set_output_delay -clock CLK  1  [get_ports {NIC_do[0]}]
set_output_delay -clock CLK  1  [get_ports polarity_to_NIC]
